rottenpotatoes/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "movies" SET "director" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", ""], ["release_date", "2011-08-09 00:00:00.000000"], ["updated_at", "2017-05-30 14:46:46.761833"], ["id", 4]]

  def similar_movies
    @similar_movies = Movie.search_by_director(Movie.find(params[:id]).director)
---
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]